Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: The number of scalars, or elements, in the vector.
ja: ベクターの中のスカラー、または要素、の数。

source: The number of strides of the pointer’s Pointee type to offset this pointer.
ja: ポインタのPointee型のストライドの数、このポインタに補われます。

source: The number of times to repeat repeatedValue in the resulting string.
ja: repeatedValueを結果文字列の中で繰り返す回数。

source: The number of times to repeat the value passed in the repeating parameter.
ja: repeatingパラメータで渡された値を繰り返す回数。

source: The number of trailing zeros in this value’s binary representation.
ja: この値のバイナリ表現において後に続くゼロの数。

source: The numeric type of a scalar.
ja: あるスカラーの数値型。

source: The numeric type of the scalar.
ja: このスカラーの数値型。

source: The numeric value of the scalar.
ja: このスカラーの数値。

source: The object referenced by this Unmanaged instance.
ja: このUnmanagedインスタンスによって参照されるオブジェクト。

source: The object to encode.
ja: エンコードするオブジェクト。

source: The offset from this pointer at which to access an instance, measured in strides of the pointer’s Pointee type.
ja: このポインタからのオフセット、それでインスタンスにアクセスします、ポインタのPointee型のストライドにおいて測られます。

source: The offset from this pointer, in bytes.
ja: このポインタからのオフセット、バイトで。

source: The offset in bytes into the buffer pointer’s memory to begin reading data for the new instance.
ja: 新しいインスタンスのためにデータの読み出しを開始するための、バッファポインタのもつメモリに対するバイトでのオフセット。

source: The offset into a string’s code units for this index.
ja: このインデックスに対する、ある文字列のもつコード単位へのオフセット。

source: The offset of the byte to access.
ja: アクセスすることになるバイトのオフセット。

source: The offset, in bytes, into the buffer pointer’s memory at which to begin reading data for the new instance.
ja: バッファポインタのもつメモリに対する、バイトでの、オフセット、それで新しいインスタンスに対してデータ読み出しを始めることになります。

source: The only scalars for which this property is true are:
ja: 以下のスカラーに対してのみこのプロパティはtrueです：

source: The opaque pointer to convert to a typed pointer.
ja: 型付ポインタに変換されることになる不透明ポインタ。

source: The operation doesn’t require going beyond the limiting numbers.endIndex value, so it succeeds.
ja: この操作は、限度であるnumbers.endIndex値を越えることを要求しません、それでそれは成功します。

source: The operation doesn’t require going beyond the limiting s.endIndex value, so it succeeds.
ja: 演算は、限界であるs.endIndex値を越えていく必要はありません、それでそれは成功します。

source: The order of the remaining elements is preserved.
ja: 残っている要素の順番は保全されます。

source: The original version uses completion handlers to query the HealthKit SDK and to respond to CLKComplicationDataSource calls, and dispatch queues to isolate concurrent access to memory.
ja: オリジナルバージョンは、完了ハンドラを、HealthKit SDKへの問い合わせのためそしてCLKComplicationDataSource呼出しへの応答のために、そしてディスパッチキューを、メモリへの並行アクセスを隔離するために使います。

source: The overflow addition operator (&+) discards any bits that overflow the fixed width of the integer type.
ja: オーバーフロー加算演算子（&+）は、固定幅の整数型からオーバーフローするあらゆるビットを廃棄します。

source: The overflow multiplication operator (&*) discards any bits that overflow the fixed width of the integer type.
ja: オーバーフロー乗算演算子（&*）は、固定幅の整数型からオーバーフローするあらゆるビットを廃棄します。

source: The overflow subtraction operator (&-) discards any bits that overflow the fixed width of the integer type.
ja: オーバーフロー減算演算子（&-）は、固定幅の整数型からオーバーフローするあらゆるビットを廃棄します。

source: The path of coding keys taken to get to this point in decoding.
ja: デコーディングのこの時点を得るために取られるコーディングキーのパス。

source: The path of coding keys taken to get to this point in encoding.
ja: エンコーディングのこの時点を得るために取られるコーディングキーのパス。

source: The pointer argument is valid only for the duration of the method’s execution.
ja: ポインタ引数は、ただメソッドの実行の間に対してのみ有効です。

source: The pointer argument to body is valid only during the execution of withUTF8Buffer(_:).
ja: bodyへのポインタ引数は、withUTF8Buffer(_:)の実行の間のみ有効です。

source: The pointer created through implicit bridging of an instance or of an array’s elements is only valid during the execution of the called function.
ja: インスタンスのまたは配列の要素の暗黙的ブリッジを通して作成されるポインタは、呼び出された関数の実行の間に有効であるだけです。

source: The pointer passed as start must be aligned to MemoryLayout<Element>.alignment.
ja: startとして渡されるポインタは、MemoryLayout<Element>.alignmentにアラインされなければなりません。

source: The pointer passed as an argument to body is valid only during the execution of withCString(_:).
ja: 引数としてbodyに渡されるポインタは、withCString(_:)の実行の間のみ有効です。

source: The pointer passed as an argument to body is valid only during the execution of withCString(encodedAs:_:).
ja: 引数としてbodyに渡されるポインタは、withCString(encodedAs:_:)の実行の間のみ有効です。

source: The pointer to calculate the distance to.
ja: それへの隔たりを計算されるポインタ。

source: The pointer to convert.
ja: 変換されることになるポインタ。

source: The pointer to use as the source for the new integer.
ja: 新しい整数のためのソースとして使う値。

source: The pointer you pass to the function is only guaranteed to be valid for the duration of the function call.
ja: あなたが関数に渡すポインタは、関数呼び出しの間に対して有効であることだけを保証されます。

source: The position at which to insert the new element.
ja: そこで新しい要素が挿入されることになる位置。

source: The position at which to insert the new elements.
ja: そこで新しいいくらかの要素が挿入されるところの位置。

source: The position in characters that corresponds exactly to this index.
ja: このインデックスに正確に対応するcharactersの中の位置。

source: The position in unicodeScalars that corresponds exactly to this index.
ja: このインデックスに正確に対応するunicodeScalarsの中の位置。

source: The position in utf16 that corresponds exactly to this index.
ja: このインデックスに正確に対応するutf16の中の位置。

source: The position in utf8 that corresponds exactly to this index.
ja: このインデックスに正確に対応するutf8の中の位置。

source: The position of the character to remove.
ja: 削除する文字の位置。

source: The position of the element to access.
ja: アクセスする要素の位置。

source: The position of the element to remove.
ja: 削除する要素の位置。

source: The position of the first Unicode scalar value if the string is nonempty.
ja: 文字列が空でないならば、最初のユニコードスカラー値の位置。

source: The position of the first character in a nonempty string.
ja: 空でない文字列の中の最初の文字の位置。

source: The position of the first code unit if the String is nonempty; identical to endIndex otherwise.
ja: Stringが空で無いならば最初のコードユニットの位置；そうでないならばendIndexと同一です。

source: The position of the first code unit if the UTF-8 view is nonempty.
ja: UTF-8ビューが空でないならば、最初のコードユニットの位置。

source: The position of the first code unit.
ja: 最初のコード単位の位置。

source: The position of the first element in a nonempty collection.
ja: 空でないコレクションの中の最初の要素の位置。

source: The postfix operators are as follows:
ja: 接尾辞演算子は次のとおりです：

source: The predicate executes each time the asynchronous sequence produces an element, until either the predicate finds a match or the sequence ends.
ja: 述部は、非同期シーケンスがある要素を生み出すたびごとに遂行されます、述部がある合致を見つけるかシーケンスが終わるかどちらかまで。

source: The predicate executes each time the asynchronous sequence produces an element, until either the predicate returns false or the sequence ends.
ja: 述部は、非同期シーケンスがある要素を生み出すたびごとに遂行されます、述部がfalseを返すかシーケンスが終わるかどちらかまで。

source: The predicate must be a equivalence relation over the elements.
ja: 述部は要素に対して同値関係でなければなりません。

source: The predicate must be a strict weak ordering over the elements.
ja: 述部は、それら要素に対して厳密弱順序でなければなりません。

source: The predicate orders errors before successes and sorts the error responses by their error code.
ja: この述部はエラーを成功の前に並べて、そしてそれらエラー応答をそのエラーコードによってソートします。

source: The predicate provided to the max(by:) method sorts ranks based on their rawValue:
ja: max(by:)メソッドに提供された述部は、ランクそれらをそれらのrawValueに基づいて並べ換えます：

source: The predicate provided to the min(by:) method sorts ranks based on their rawValue:
ja: min(by:)メソッドに提供された述部は、ランクそれらをそれらのrawValueに基づいて並べ換えます：

source: The prefix operators are as follows:
ja: 接頭辞演算子は次のとおりです：

source: The product of x and y is 2000, which is too large to represent in a UInt8 instance.
ja: xとyの積は2000です、それはUInt8インスタンスにおいて表すには大きすぎます。

source: The product of x and y is -1920, which is too large to represent in an Int8 instance.
ja: xとyの積は-1920です、それはInt8インスタンスにおいて表すには大きすぎます。

source: The product of the two arguments must be representable in the arguments’ type.
ja: ２つの引数の積は、引数の持つ型において表現可能でなければなりません。

source: The protocol to which all class types implicitly conform.
ja: このプロトコルに対して、全てのクラス型は暗黙的に準拠します。

source: The protocol to which all classes implicitly conform.
ja: このプロトコルに対して、全てのクラスは暗黙的に準拠します。

source: The published name of the scalar.
ja: このスカラーの公開名。

source: The radix, or base, to use for converting text to an integer value.
ja: textを整数値に変換するのに使うための基数、または底。

source: The random number generator to use when choosing a random element.
ja: ある無作為な要素を選ぶときに使う無作為数生成子。

source: The random number generator to use when creating the new random value.
ja: 新しい無作為値を作成するときに使う無作為数生成子。

source: The random number generator to use when shuffling the collection.
ja: コレクションをシャッフルするときに使う無作為数生成子。

source: The random number generator to use when shuffling the sequence.
ja: シーケンスをシャッフルするときに使う無作為数生成子。

source: The range expression is converted to a concrete subrange relative to this collection.
ja: 範囲式は、このコレクションに関連するある具体的な下位範囲へ変換されます。

source: The range in which to create a random value.
ja: その中においてある無作為な値が作成される範囲。

source: The range of byte offsets to access.
ja: アクセスすることになるバイトオフセットの範囲。

source: The range of elements to replace.
ja: 置き換えることになる要素範囲。

source: The range of indices to allow access to in the new slice.
ja: 新しいスライスにおいて、アクセスするのが許されるインデックスの範囲。

source: The range of text to replace.
ja: 置き換えるテキスト範囲。

source: The range of the collection to be removed.
ja: 削除されることになるコレクションの範囲。

source: The range of the elements to remove.
ja: 削除する要素の範囲。

source: The raw buffer slice to rebase.
ja: 再構築される生のバッファスライス。

source: The raw integer value of the canonical combining class.
ja: この正準結合クラスの生の整数値。

source: The raw type that can be used to represent all values of the conforming type.
ja: 準拠している型のすべての値を表すために使われる生の型。

source: The raw value to use for the new instance.
ja: 新しいインスタンスのために使う生の値。

source: The region of memory starting at this pointer and covering count instances of the pointer’s Pointee type must be initialized or Pointee must be a trivial type.
ja: このポインタで始まりそしてポインタのPointee型のcount個のインスタンスを対象とするメモリ領域は初期化されなければならず、またPointeeは自明型でなければなりません。

source: The region of memory starting at this pointer and covering count instances of the pointer’s Pointee type must be initialized.
ja: このポインタで始まりそしてポインタのもつPointee型のcount個のインスタンスを対象とするメモリ領域は、初期化されなければなりません。

source: The region of memory starting at this pointer and covering count instances of the pointer’s Pointee type must be uninitialized or Pointee must be a trivial type.
ja: このポインタで始まりそしてポインタのPointee型のcount個のインスタンスを対象とするメモリ領域は未初期化でなければなりません、またPointeeは自明型でなければなりません。

source: The remainder of the allocated region is unbound raw memory.
ja: 割り当てられた領域の残りは、生のメモリに束縛されません。

source: The remainder of the relational operator functions are implemented by the standard library for any type that conforms to Comparable.
ja: 残りの関係演算子関数は、Comparableに準拠するあらゆる型に対して標準ライブラリによって実装されます。

source: The removed element.
ja: 削除された要素。

source: The requested number of elements to store.
ja: 依頼された格納される要素数。

source: The result begins with the first element of numbers that does not satisfy predicate.
ja: 結果は、predicateを満たさない、numbersの最初の要素で始まります。

source: The result can be negative only if the collection conforms to the BidirectionalCollection protocol.
ja: 結果は、そのコレクションがBidirectionalCollectionプロトコルに準拠する場合に限り、負であることができます。

source: The result has the same sign as lhs and has a magnitude less than rhs.magnitude.
ja: 結果は、lhsと同じ符号を持ち、rhs.magnitudeより小さい規模を持ちます。

source: The result of attempting to parse a T from some input.
ja: なんらかの入力からのTを構文解析を試みることの結果。

source: The result of one Unicode decoding step.
ja: ひとつのユニコード復号化処理の結果。

source: The result of the remainder operator (%) has the same sign as lhs and has a magnitude less than rhs.magnitude.
ja: 剰余演算子（%）の結果は、lhsと同じ符号を持ち、rhs.magnitudeより小さい規模を持ちます。

source: The result.
ja: その結果。

source: The resulting array consists of at most maxSplits + 1 subsequences.
ja: 結果の配列は、多くともmaxSplits + 1の下位シーケンスから成ります。

source: The resulting buffer references a region of memory that is bound to Element and is count * MemoryLayout<Element>.stride bytes in size.
ja: 結果のバッファはあるメモリ領域を参照します、それはElementに束縛されます、そしてcount * MemoryLayout<Element>.strideバイトの大きさです。

source: The resulting collection has the type of argument on the right-hand side.
ja: 結果となるコレクションは、右手側の引数の型を持ちます。

source: The resulting collection has the type of the argument on the left-hand side.
ja: 結果となるコレクションは、左手側の引数の型を持ちます。

source: The resulting flattened array.
ja: 結果として生じる平たくされた配列。

source: The resulting instance may not have the same numeric value as bitPattern—it is only guaranteed to use the same pattern of bits in its binary representation.
ja: 結果のインスタンスは、bitPatternと同じ数値を持たないかもしれません — それは、同じパターンのビットをそれのバイナリ表現において使うことを保証されるだけです。

source: The resulting pointer must be within the bounds of the same allocation as this pointer.
ja: 結果のポインタは、このポインタと同じアロケーションの範囲内でなければなりません。

source: The resulting pointer references a region of memory that is bound to Pointee and is count * MemoryLayout<Pointee>.stride bytes in size.
ja: 結果のポインタはあるメモリ領域を参照します、それはPointeeに束縛されます、そしてcount * MemoryLayout<Pointee>.strideバイトの大きさです。

source: The resulting quotient must be representable within the bounds of the type.
ja: 結果の商は、この型の境界の内に表現可能でなければなりません。

source: The resulting subsequence does not include the element at the position end.
ja: 結果となるシーケンスは、位置endでの要素を含みません。

source: The resulting subsequence includes the element at the position end.
ja: 結果となるシーケンスは、位置endでの要素を含みます。

source: The return type of sequence(first:next:).
ja: sequence(first:next:)の戻り型。

source: The return type of functions that do not return normally, that is, a type with no values.
ja: 普通に戻らない関数の戻り型、すなわち、値なしでの型。

source: The return type of functions that don’t explicitly specify a return type, that is, an empty tuple ().
ja: 戻り型を明示的に指定されない関数の戻り型、すなわち、空のタプル()。

source: The return value, if any, of the body closure parameter.
ja: bodyクロージャパラメータの戻り値、もしあれば。

source: The return value, if any, of the body closure.
ja: bodyクロージャの、もしあれば、戻り値。

source: The returned buffer references memory starting at the same base address as this buffer.
ja: 返されるバッファは、このバッファと同じ基底アドレスで始まるメモリを参照します。

source: The returned index is the position of the element in the buffer one past the last element written.
ja: 返されるインデックスは、書かれた最後の要素を１つすぎたバッファの中の要素の位置です。

source: The returned instance is memory-managed and unassociated with the value in the memory referenced by this pointer.
ja: 返されるインスタンスは、メモリ管理されて、このポインタによって参照されるメモリの中の値と無関係です。

source: The second byte is a continuation byte.
ja: ２番目のバイトが継続バイトです。

source: The second example passes 1 for the maxSplits parameter, so the original string is split just once, into two new strings.
ja: ２番目の例は1をmaxSplitsパラメータに渡します、それで元の文字列は一度だけ分割されて、２つの新しい文字列になります。

source: The second partition, numbers[p...], is made up of the elements that are greater than 30.
ja: ２番目の区画、numbers[p...]は、30より大きなものである要素から構成されます。

source: The second value to add.
ja: 加算する第２の値。

source: The second value to multiply.
ja: 掛け合わされる第２の値。

source: The sequence ends either when the base sequence ends or when transform throws an error.
ja: シーケンスは、基底シーケンスが終わる時かまたはtransformがエラーをスローする時に終わります。

source: The sequence ends either when the the last sequence created from the last element from base sequence ends, or when transform throws an error.
ja: シーケンスは、基底シーケンスからの最後の要素から作成された最後のシーケンスが終わる時、またはtransformがエラーをスローする時のどちらかに終わります。

source: The sequence must be finite.
ja: シーケンスは有限でなければなりません。

source: The sequence of elements for the new collection.
ja: 新しいコレクションのための要素からなるシーケンス。

source: The sequences whose contents to encode.
ja: それの内容をエンコードするシーケンス。

source: The sequence’s maximum element if the sequence is not empty; otherwise, nil.
ja: シーケンスが空でないならばシーケンスの最大の要素；そうでなければnil。

source: The sequence’s maximum element.
ja: シーケンスの最大の要素。

source: The sequence’s minimum element, according to areInIncreasingOrder.
ja: シーケンスの最小の要素、areInIncreasingOrderによる。

source: The sequence’s minimum element.
ja: シーケンスの最小の要素。

source: The set of scalars [:XID_Continue:] closes the set [:ID_Continue:] under NFKC normalization by removing any scalars whose normalized form is not of the form [:ID_Continue:]*.
ja: スカラーの集合[:XID_Continue:]は、集合[:ID_Continue:]に、NFKC正規化の下で、それの正規化形式が形式[:ID_Continue:]*でないあらゆるスカラーを取り除くことによって、閉じています。

source: The set of scalars [:XID_Start:] closes the set [:ID_Start:] under NFKC normalization by removing any scalars whose normalized form is not of the form [:ID_Start:] [:ID_Continue:]*.
ja: スカラーの集合[:XID_Start:]は、集合[:ID_Start:]に、NFKC正規化の下で、それの正規化形式が形式[:ID_Start:] [:ID_Continue:]*でないあらゆるスカラーを取り除くことによって、閉じています。

source: The set of scalars for which isGraphemeBase is true is disjoint by definition from the set for which isGraphemeExtend is true.
ja: それに対してisGraphemeBaseがtrueであるスカラーの集合は、それに対してisGraphemeExtendがtrueである集合からの定義と交わりを持ちません。

source: The set of scalars for which isGraphemeExtend is true is disjoint by definition from the set for which isGraphemeBase is true.
ja: それに対してisGraphemeExtendがtrueであるスカラーの集合は、それに対してisGraphemeBaseがtrueである集合からの定義と交わりを持ちません。

source: The set of scalars for which isCased is true is a superset of those for which changesWhenCaseMapped is true.
ja: それに対してisCasedがtrueであるスカラーの集合は、それに対してchangesWhenCaseMappedがtrueであるもののスーパーセットです。

source: The set of scalars for which this property is true includes mathematical operators and symbols as well as specific Greek and Hebrew letter variants that are categorized as symbols.
ja: それに対してこのプロパティがtrueであるスカラーの集合は、数学用の演算子と記号を含みます、記号として分類される特定のギリシャおよびベブライ文字異字体だけでなく。

source: The shift is performed using this masked value.
ja: シフトは、このマスクされた値を使って実行されます。

source: The sign of this number, expressed as an integer of the same type.
ja: この数の符号、同じ型の整数として表されます。

source: The sorting algorithm is not guaranteed to be stable.
ja: このソートアルゴリズムは、安定であることを保証されません。

source: The standard library implements codecs for the UTF-8, UTF-16, and UTF-32 encoding schemes as the UTF8, UTF16, and UTF32 types, respectively.
ja: 標準ライブラリは、UTF-8、UTF-16、そしてUTF-32エンコードスキームに対するコーデックをUTF8、UTF16、そしてUTF32型としてそれぞれ実装します。

source: The string is automatically converted to UTF8 in a zero-terminated buffer, and a pointer to that buffer is passed to the function.
ja: 文字列は、自動的にゼロ終端バッファの中のUTF8に変換されます、そしてそのバッファに対するポインタが関数に渡されます。

source: The string passed as description may begin with a plus or minus sign character (+ or -), followed by one or more numeric digits (0-9).
ja: descriptionとして渡される文字列は、プラスまたはマイナス符号文字（+または-）で始まり、１つ以上の数値のアラビア数字（0-9）が続くことがあります。

source: The string passed as text may begin with a plus or minus sign character (+ or -), followed by one or more numeric digits (0-9) or letters (a-z or A-Z).
ja: textとして渡される文字列は、プラスまたはマイナス符号文字（+または-）で始まり、１つ以上の数値のアラビア数字（0-9）または文字（a-z or A-Z）が続くことがあります。

source: The string referenced by the resulting index.
ja: 結果となるインデックスによって参照される文字列。

source: The string to repeat.
ja: 繰り返すことになる文字列。

source: The string to use for the index conversion.
ja: インデックス変換に使う文字列。

source: The string value of the unique identifier wrapped in a data value.
ja: データ値の中にラップされる特有識別子の文字列値。

source: The string wrapped in a data value.
ja: データ値の中にラップされる文字列。

source: The string’s value represented as a collection of Unicode scalar values.
ja: ユニコードスカラー値のコレクションとして表される、文字列のもつ値。

source: The subrange of the collection to remove.
ja: 削除することになるコレクションの下位範囲。

source: The subrange of the collection to replace.
ja: 置き換えることになるコレクションの下位範囲。

source: The subscript notation is preferred over prefix(through:).
ja: 添え字表記法は、prefix(through:)よりも好まれます。

source: The subscript notation is preferred over suffix(from:).
ja: 添え字表記法は、suffix(from:)よりも好まれます。

source: The subscript notation is preferred over prefix(upTo:).
ja: 添え字表記法は、prefix(upTo:)よりも好まれます。

source: The subtraction operator (-) calculates the difference of its two arguments.
ja: 減算演算子（-）は、それの２つの引数の差を計算します。

source: The successor of an index must be well defined.
ja: あるインデックスの後に続くものは、よく定義されなければなりません。

source: The sum of the two arguments must be representable in the arguments’ type.
ja: ２つの引数の合計は、引数の持つ型において表現可能でなければなりません。

source: The sum of types that can be used as a Quick Look representation.
ja: 「クイックルック」表現として使われることのできる型の総和。

source: The system’s default source of random data.
ja: システムの持つ省略時の無作為データのソース。

source: The tables below list the operators declared by the Swift standard library.
ja: 以下の表は、Swift標準ライブラリによって宣言される演算子を一覧にします。

source: The task continues executing when its executor schedules it.
ja: タスクは、それのエグゼキュータがそれを予定する場合は遂行を継続します。

source: The task this refers to may check for cancellation, however since it is not-throwing it would have to handle it using some other way than throwing a CancellationError, e.g. it could provide a neutral value of the Success type, or encode that cancellation has occurred in that type itself.
ja: これが参照するタスクは、取り消しについて確認するかもしれません、しかしながらそれがスローするものでないことからそれはそれをCancellationErrorをスローするのと違った何か他の方法を使って取り扱わなければならないでしょう、たとえばそれはSuccess型の中立の値を提供できます、または取り消しがその型それ自体において発生したことをエンコードできるでしょう。

source: The titlecase mapping of the scalar.
ja: このスカラーのタイトルケースマッピング。

source: The trailing surrogate code unit of x when encoded in UTF-16.
ja: UTF-16でエンコードされる時のxの後続サロゲートペア。

source: The transforming closure takes the received Int and returns a new Counter that counts that high.
ja: 変換クロージャは、その受け取ったIntをとり、そしてその高さを数える新しいCounterを返します。

source: The two arguments must have the same Element type.
ja: ２つの引数は、同じElement型を持たなければなりません。

source: The two loops in the following example produce the same output:
ja: 以下の例における２つのループは、同じ出力を生み出します：

source: The two types communicate by passing an array of Drink values, which is a value type because Drink is a structure.
ja: ２つの型は、Drink値それらからなるある配列を渡すことによって通信します、それは値型です、なぜならDrinkが構造体であるからです。

source: The type T must be the same size and be layout compatible with the pointer’s Pointee type.
ja: 型 Tは、ポインタのもつPointee型と同じサイズで、互換性のあるレイアウトでなければなりません。

source: The type T must have the same size and be layout compatible with the pointer’s Element type.
ja: 型 Tは、ポインタのもつElement型と同じサイズで、互換性のあるレイアウトでなければなりません。

source: The type T that the memory has already been bound to.
ja: メモリがすでに束縛されているところの型T。

source: The type T to be stored must be a trivial type.
ja: 格納されることになる型Tは、自明型でなければなりません。

source: The type T to bind the memory to.
ja: この型Tへとメモリを束縛することになります。

source: The type each segment of a string literal containing interpolations should be appended to.
ja: 加えられるべき補間を含んでいる文字列リテラルの各文節の型。

source: The type of value.
ja: valueの型。

source: The type of an unbounded range operator.
ja: 無境界範囲演算子の型。

source: The type of asynchronous iterator that produces elements of this asynchronous sequence.
ja: この非同期シーケンスの要素それらを取り出す非同期イテレータの型。

source: The type of data that a pointer can access is the pointer’s Pointee type.
ja: ポインタがアクセス可能なデータの型は、ポインタのもつPointee型です。

source: The type of element produced by this asynchronous sequence.
ja: この非同期シーケンスによって取り出される要素の型。

source: The type of element returned by next().
ja: next()によって返される要素のもつ型。

source: The type of element traversed by the iterator.
ja: このイテレータによって辿っていかれる要素の型。

source: The type of scalars in the vector space.
ja: このベクタースペースの中のスカラーそれらの型。

source: The type of the elements of an array literal.
ja: 配列リテラルの要素の型。

source: The type of the elements to bind the buffer’s memory to.
ja: バッファのもつメモリをそれへと束縛する幾らかの要素の型。

source: The type of the instance to create.
ja: 作成されることになるインスタンスの型。

source: The type of value to decode.
ja: この型の値にデコードする。

source: The type that should be used for literal segments.
ja: リテラル文節に対して使われるべき型。

source: The type to bind this buffer’s memory to.
ja: このバッファのもつメモリをそれへと束縛する型。

source: The type to bind this memory to.
ja: このメモリに束縛することになる型。

source: The type to decode as.
ja: この型としてデコードします。

source: The type to temporarily bind the memory referenced by this buffer.
ja: このバッファによって参照されるメモリを一時的に束縛する型。

source: The type to temporarily bind the memory referenced by this pointer.
ja: このポインタによって参照されるメモリを一時的に束縛する型。

source: The type to use for the newly constructed instance.
ja: 新規に構築されるインスタンスのために使うことになる型。

source: The typed buffer contains self.count / MemoryLayout<T>.stride instances of T.
ja: Tのself.count / MemoryLayout<T>.strideインスタンスを含んでいる型付バッファ。
